load-test/load-test.yml
config:
  target: "http://localhost:3001"
  # 150 concurrent = ramp to 15/sec over 10s, cap at 150 in-flight VUs,
  # sustain for 90s, then ramp down. Each scenario loops ~60-90s so
  # VU count stays around the cap throughout the sustained phase.
  phases:
    - name: "Ramp up to 150 concurrent"
      duration: 10
      arrivalRate: 15        # 15 new VUs/s → 150 total after 10s
      maxVUsers: 150
    - name: "Sustained — 150 concurrent users"
      duration: 90
      arrivalRate: 3         # trickle of replacements for completed sessions
      maxVUsers: 150
    - name: "Ramp down"
      duration: 10
      arrivalRate: 1
      maxVUsers: 150
  defaults:
    headers:
      Content-Type: "application/json"
  ensure:
    p99: 3000          # 99th percentile < 3 s
    p95: 1500          # 95th percentile < 1.5 s
    maxErrorRate: 2    # < 2% errors

scenarios:
  # ── Admin flow (30%): browse dashboard, calls, tickets, agents ───────────
  - name: "Admin — dashboard + calls + analysis + agents"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "admin"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "token"
      - think: 2
      - get:
          url: "/api/calls/stats/summary"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/calls?limit=25&offset=0&sortBy=created_at&sortDir=desc"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/calls?limit=25&offset=25&sortBy=created_at&sortDir=desc"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/tickets?limit=25&offset=0&status=Open"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/analysis?limit=25&offset=0"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/agents"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 3

  # ── Agent flow (50%): calls + tickets + stats ────────────────────────────
  - name: "Agent — call report + tickets + stats"
    weight: 50
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "admin"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "token"
      - think: 2
      - get:
          url: "/api/calls/stats/summary"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/calls?limit=25&offset=0"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 3
      - get:
          url: "/api/tickets?limit=50&offset=0&status=Open"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/calls?limit=25&offset=0&status=missed"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 3

  # ── Health / lightweight checks (20%) ────────────────────────────────────
  - name: "Health checks"
    weight: 20
    flow:
      - get:
          url: "/health"
      - think: 5
      - get:
          url: "/health"
      - think: 5